src/main/resources/webServiceRequestXmls/WalletToWalletTransfer.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:elt="http://eltws.map.ecs.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <elt:callWalletToWallet>
         <!--Optional:-->
         <walletToWalletRequest>
            <!--Optional:-->
            <remarks>first transfer</remarks>
            <!--Optional:-->
            <sourceWallet>5512340505170001382</sourceWallet>
            <!--Optional:-->
            <destinationWallet>5512340505170001385</destinationWallet>
            <!--Optional:-->
            <transactionAmount>11</transactionAmount>
            <!--Optional:-->
            <serviceCode>48</serviceCode>
            <!--Optional:-->
            <sourceDeviceNumber>5512340000000100162</sourceDeviceNumber>
            <!--Optional:-->
            <destinationDeviceNumber>5512340000000100162</destinationDeviceNumber>
            <!--Optional:-->
            <transactionCounter>1</transactionCounter>
            <!--Optional:-->
            <channel>31</channel>
            <!--Optional:-->
            <origin>DOM</origin>
            <!--Optional:-->
            <sessionKey>3135G6AB4IHQ0VZ7O3B8SAG</sessionKey>
            <!--Optional:-->
            <userId>amitcl</userId>
            <!--Optional:-->
            <txnPassword>amitcl</txnPassword>
            <!--Optional:-->
            <passCodeFlag>N</passCodeFlag>
            <!--Optional:-->
           <passCode></passCode>
            <!--Optional:-->
            <traceAuditNumber>100001</traceAuditNumber>
         </walletToWalletRequest>
      </elt:callWalletToWallet>
   </soapenv:Body>
</soapenv:Envelope>